run/bubble/template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0 0 0) //0
    (0.01 0 0) //1
    (0.01 8e-3 0) //2
    (0 8e-3 0) //3
    (0 0 8e-3) //4
    (0.01 0 8e-3) //5
    (0.01 8e-3 8e-3) //6
    (0 8e-3 8e-3) //7
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (64 48 48) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(
    left
    {
	    type patch;
	    //neighbourPatch right;
	    faces
	    (
	     (0 4 5 1)
	    );
    }
    right
    {
	    type patch;
	    //neighbourPatch left;
	    faces
	    (
	     (2 6 7 3)
	    );
    }

    front
    {
	    type patch;
	    faces
	    (
		(0 1 2 3)
	    );
    }

    back
    {
	    type patch;
	    faces
	    (
		(4 5 6 7)
	    );
    }
    bottom 
    {
	    type patch;
	    faces
	    (
		(0 3 7 4)
	    );
    }
    top 
    {
	    type patch;
	    faces
	    (
		(1 2 6 5)
	    );
    })

mergePatchPairs
(
);

// ************************************************************************* //
