run/bubble/template/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0 0);

boundaryField
{
          
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    left          
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    right          
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    bottom          
    {
        type            zeroGradient;
    }

    back
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }
    front
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }
}

// ************************************************************************* //
