run/bubble/template/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      funkySetFieldsDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
expressions
(
	initZero
	{
		field alpha1;
		create false;
		expression "0";
		keepPatches true ;
	}
	setBubble
	{
		field alpha1 ;
		expression "1" ;
		keepPatches true ;
		condition "mag(pos()-vector(0.007,0.004,0.004))<0.0005" ;
	}
);
