run/bubble/template/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    //volScalarFieldValue alpha1 1
    volVectorFieldValue U (0 0 1)
);

regions
(
    boxToCell
    {
        box (-1 -1 0) (1 -0.0898 1);
        fieldValues
        (
            //volScalarFieldValue alpha1 0
	    //volVectorFieldValue U (0 0 0)
        );
    }
);


// ************************************************************************* //
